In [5]:
%%capture
%load_ext sql
%sql sqlite:///chinook.db

In [6]:
%%sql
SELECT 
name,
`type`
FROM sqlite_master
WHERE `type` IN ("table","view");

* sqlite:///chinook.db
Done.

[('album', 'table'),
 ('artist', 'table'),
 ('customer', 'table'),
 ('employee', 'table'),
 ('genre', 'table'),
 ('invoice', 'table'),
 ('invoice_line', 'table'),
 ('media_type', 'table'),
 ('playlist', 'table'),
 ('playlist_track', 'table'),
 ('track', 'table'),
 ('customer_2', 'view'),
 ('customer_gt_90_dollars', 'view')]

In [7]:
%%sql
SELECT *
FROM artist
LIMIT 3;

* sqlite:///chinook.db
Done.

[(1, 'AC/DC'), (2, 'Accept'), (3, 'Aerosmith')]

# Question 1
Which genres sell the most and which artist we should purchase for the store

In [4]:
import pandas as pd 

artist = {\
    'Artist':\
    ['Regal','Red Tone','Meteor and the Girls','Slim Jim Bites'],\
    'Genre':\
    ['Hip-Hop','Punk','Pop','Blues']\
}


pd.DataFrame(artist)

                 Artist    Genre
0                 Regal  Hip-Hop
1              Red Tone     Punk
2  Meteor and the Girls      Pop
3        Slim Jim Bites    Blues

In [27]:
%%sql
WITH TOTAL as (
    SELECT SUM(quantity) as tot
    FROM invoice_line
)

SELECT 
    genre.name,
    SUM(invoice_line.quantity) ,
    ROUND(SUM(invoice_line.quantity)/CAST((SELECT * FROM TOTAL) AS REAL),2)
FROM genre 
INNER JOIN track ON genre.genre_id = track.genre_id
INNER JOIN invoice_line ON invoice_line.track_id = track.track_id
GROUP BY 1
ORDER BY 2 DESC;

* sqlite:///chinook.db
Done.

[('Rock', 2635, 0.55),
 ('Metal', 619, 0.13),
 ('Alternative & Punk', 492, 0.1),
 ('Latin', 167, 0.04),
 ('R&B/Soul', 159, 0.03),
 ('Blues', 124, 0.03),
 ('Jazz', 121, 0.03),
 ('Alternative', 117, 0.02),
 ('Easy Listening', 74, 0.02),
 ('Pop', 63, 0.01),
 ('Electronica/Dance', 55, 0.01),
 ('Classical', 47, 0.01),
 ('Reggae', 35, 0.01),
 ('Hip Hop/Rap', 33, 0.01),
 ('Heavy Metal', 8, 0.0),
 ('Soundtrack', 5, 0.0),
 ('TV Shows', 2, 0.0),
 ('Drama', 1, 0.0)]

# Question 2

Each customer for the Chinook store gets assigned to a sales support agent within the company when they first make a purchase. You have been asked to analyze the purchases of customers belonging to each employee to see if any sales support agent is performing either better or worse than the others.

In [34]:
%%sql
WITH supp AS (SELECT 
    customer.customer_id,
    customer.support_rep_id,
    ROUND(SUM(invoice.total),2) user_purchased
FROM invoice INNER JOIN customer ON invoice.customer_id = customer.customer_id
GROUP BY 1,2)

SELECT 
    employee.employee_id,
    employee.title,
    employee.country,
    ROUND(SUM(supp.user_purchased),2)
FROM employee INNER JOIN supp ON employee.employee_id = supp.support_rep_id
GROUP BY 1;

* sqlite:///chinook.db
Done.

[(3, 'Sales Support Agent', 'Canada', 1731.51),
 (4, 'Sales Support Agent', 'Canada', 1584.0),
 (5, 'Sales Support Agent', 'Canada', 1393.92)]

# Question 3

In [59]:
%%sql
WITH customer_total AS ( SELECT
    customer.country,
    COUNT(customer.country) as total_customer
FROM customer
GROUP BY 1) ,
    country_total AS (SELECT  customer_total.* ,
        CASE WHEN total_customer = 1 THEN 1
            ELSE 0 END AS other
    FROM customer_total)

SELECT 
    invoice.billing_country `Country`,
    COUNT(invoice.customer_id) `Total No. of Customers`,
    ROUND(SUM(invoice.total),2) `Total Value of Sales`,
    ROUND(SUM(invoice.total) / COUNT(invoice.customer_id),2) `Average Value of Sales`,
    ROUND(AVG(invoice.total),2) `Average Order Value`
FROM invoice INNER JOIN country_total ON invoice.billing_country = country_total.country
GROUP BY 1
ORDER BY country_total.other ASC;

* sqlite:///chinook.db
Done.

[('Brazil', 61, 427.68, 7.01, 7.01),
 ('Canada', 76, 535.59, 7.05, 7.05),
 ('Czech Republic', 30, 273.24, 9.11, 9.11),
 ('France', 50, 389.07, 7.78, 7.78),
 ('Germany', 41, 334.62, 8.16, 8.16),
 ('India', 21, 183.15, 8.72, 8.72),
 ('Portugal', 29, 185.13, 6.38, 6.38),
 ('USA', 131, 1040.49, 7.94, 7.94),
 ('United Kingdom', 28, 245.52, 8.77, 8.77),
 ('Argentina', 5, 39.6, 7.92, 7.92),
 ('Australia', 10, 81.18, 8.12, 8.12),
 ('Austria', 9, 69.3, 7.7, 7.7),
 ('Belgium', 7, 60.39, 8.63, 8.63),
 ('Chile', 13, 97.02, 7.46, 7.46),
 ('Denmark', 10, 37.62, 3.76, 3.76),
 ('Finland', 11, 79.2, 7.2, 7.2),
 ('Hungary', 10, 78.21, 7.82, 7.82),
 ('Ireland', 13, 114.84, 8.83, 8.83),
 ('Italy', 9, 50.49, 5.61, 5.61),
 ('Netherlands', 10, 65.34, 6.53, 6.53),
 ('Norway', 9, 72.27, 8.03, 8.03),
 ('Poland', 10, 76.23, 7.62, 7.62),
 ('Spain', 11, 98.01, 8.91, 8.91),
 ('Sweden', 10, 75.24, 7.52, 7.52)]